import SectionContainer from "../ui/SectionContainer";
import SectionHeader from "../ui/SectionHeader";
import {
  HiOutlineBriefcase,
  HiOutlineChartSquareBar,
  HiOutlineCog,
  HiOutlineGlobeAlt,
  HiOutlinePresentationChartLine,
} from "react-icons/hi";
import ServiceCard from "../ui/ServiceCard";

function ServicesSection() {
  return (
    <SectionContainer>
      <SectionHeader title="خدمات" icon={<HiOutlineBriefcase />} />
      <div className="grid grid-cols-4 justify-items-center gap-6 max-sm:grid-cols-1 max-lg:grid-cols-2">
        <ServiceCard
          icon={<HiOutlineCog />}
          title="بهینه سازی استخراج و پالایش"
          text="با استفاده از مدل‌های پیشرفته یادگیری ماشین و الگوریتم‌های داده‌کاوی، ما قادر به تحلیل دقیق فرآیندهای استخراج و پالایش نفت و گاز هستیم. این خدمات به‌طور خاص برای شبیه‌سازی رفتار مخازن، پیش‌بینی تولید، و بهینه‌سازی شرایط عملیاتی طراحی شده‌اند. با شبیه‌سازی سناریوهای مختلف و تجزیه‌وتحلیل داده‌های تاریخی، این سیستم‌ها به‌طور خودکار پیشنهادات بهینه‌ای برای تنظیم شرایط استخراج و پالایش ارائه می‌دهند. بهینه‌سازی این فرآیندها نه‌تنها موجب کاهش هزینه‌ها می‌شود، بلکه باعث افزایش بهره‌وری و کاهش میزان آسیب به تجهیزات نیز خواهد شد. در نتیجه، این خدمات به بهره‌برداران کمک می‌کند تا از منابع موجود به بهترین نحو ممکن استفاده کرده و بازده کلی عملیات را افزایش دهند."
        />
        <ServiceCard
          icon={<HiOutlineGlobeAlt />}
          title="نظارت بر تجهیزات با اینترنت اشیاء (IoT)"
          text="سیستم‌های اینترنت اشیاء (IoT) به ما این امکان را می‌دهند که تجهیزات صنعتی و سیستم‌های نفتی را در زمان واقعی تحت نظارت قرار دهیم. با نصب حسگرهای هوشمند بر روی تجهیزات مختلف مانند پمپ‌ها، کمپرسورها و توربین‌ها، ما می‌توانیم اطلاعات مهمی مانند دما، فشار، ارتعاشات و مصرف انرژی را به‌طور مداوم جمع‌آوری و تحلیل کنیم. این داده‌ها با استفاده از الگوریتم‌های پیشرفته تحلیل می‌شوند تا خرابی‌های پنهان شناسایی شوند و از وقوع مشکلات جدی جلوگیری شود. به‌علاوه، با پیش‌بینی نیاز به تعمیرات و تعویض قطعات، این سیستم‌ها می‌توانند زمان خرابی و توقف سیستم‌ها را به حداقل برسانند و عملکرد کلی تجهیزات را بهبود دهند. این فناوری به کاهش هزینه‌های عملیاتی و افزایش عمر مفید تجهیزات کمک می‌کند."
        />
        <ServiceCard
          icon={<HiOutlinePresentationChartLine />}
          title="سیستم های مدیریت انرژی"
          text="مدیریت بهینه انرژی در صنعت نفت و گاز یکی از چالش‌های مهم است. با استفاده از داده‌های پیشرفته و تحلیل‌های هوش مصنوعی، ما قادر به طراحی سیستم‌هایی برای نظارت و بهینه‌سازی مصرف انرژی در تمامی مراحل فرآیند تولید، پالایش و انتقال نفت و گاز هستیم. این سیستم‌ها به‌طور هوشمند میزان انرژی مصرفی هر بخش از عملیات را بررسی کرده و پیشنهاداتی برای کاهش مصرف انرژی و افزایش بهره‌وری ارائه می‌دهند. علاوه بر این، این خدمات به کاهش انتشار گازهای گلخانه‌ای و کاهش هزینه‌های انرژی در سطح کلان کمک می‌کنند. در نهایت، این سیستم‌ها به شرکت‌ها این امکان را می‌دهند که با رعایت استانداردهای جهانی، مصرف انرژی خود را بهینه‌سازی کرده و به هدف‌های زیست‌محیطی دست یابند."
        />
        <ServiceCard
          icon={<HiOutlineChartSquareBar />}
          title="تحلیل داده های مشتریان"
          text="در دنیای امروز، داده‌های مشتریان به یکی از منابع باارزش برای توسعه کسب‌وکار تبدیل شده است. با استفاده از تکنولوژی‌های تحلیل داده و داده‌کاوی، ما به شرکت‌ها کمک می‌کنیم تا رفتار مشتریان خود را بهتر درک کرده و استراتژی‌های بازاریابی و فروش خود را بهینه‌سازی کنند. از طریق تحلیل دقیق داده‌های تاریخی، نظرات مشتریان، و رفتارهای خرید، ما می‌توانیم الگوهای مصرف و ترجیحات مشتریان را شبیه‌سازی کنیم. این تحلیل‌ها به‌ویژه در برنامه‌ریزی بلندمدت و تصمیم‌گیری‌های تجاری اهمیت دارند، زیرا به شرکت‌ها کمک می‌کنند تا نیازهای مشتریان را پیش‌بینی کنند و خدمات و محصولات خود را بر اساس این نیازها تطبیق دهند. با این روش، شرکت‌ها می‌توانند هزینه‌های عملیاتی خود را کاهش داده و از منابع بهینه‌تری برای جذب و نگه‌داشت مشتریان استفاده کنند."
        />
      </div>
    </SectionContainer>
  );
}

export default ServicesSection;
